Repository: jixianbo/openstack-mitaka
Catalog: keystone/locale/*/LC_MESSAGES/keystone.po
Languages: es, fr, pt_br

source: LDAP %s create
es: Creación de LDAP %s
fr: Création LDAP %s
pt_br: Criação de LDAP %s

source: LDAP %s delete
es: Supresión de LDAP %s
fr: Suppression LDAP %s
pt_br: Exclusão de LDAP %s

source: LDAP %s update
es: Actualización de LDAP %s
fr: Mise à jour LDAP %s
pt_br: Atualização de LDAP %s

source: Length of transformable resource id > 64, which is max allowed characters
es: Longitud del ID de recurso transformable > 64, que es el número máximo de caracteres permitidos
fr: Longueur de l'ID de ressource transformable > 64 (nombre maximal de caractères autorisé)
pt_br: O comprimento do recurso transformável id > 64, que é o máximo de caracteres permitidos

source: Local section in mapping %(mapping_id)s refers to a remote match that doesn't exist (e.g. {0} in a local section).
es: La sección local de la correlación %(mapping_id)s hace referencia a una coincidencia remota que no existe (p.e. {0} en una sección local).
fr: La section locale dans le mappage %(mapping_id)s fait référence à une correspondance éloignée qui n'existe pas (par exemple, {0} dans une section locale).
pt_br: A seção local no mapeamento %(mapping_id)s refere-se a uma correspondência remota que não existe (por exemplo, '{0}' em uma seção local).

source: Lock Timeout occurred for key, %(target)s
es: Se ha excedido el tiempo de espera de bloqueo para la clave, %(target)s
fr: Un dépassement de délai de verrouillage s'est produit pour la clé, %(target)s
pt_br: Ocorreu um tempo limite de bloqueio para a chave, %(target)s

source: Lock key must match target key: %(lock)s != %(target)s
es: La clave de bloqueo debe coincidir con la clave de destino: %(lock)s != %(target)s
fr: La clé de verrouillage doit correspondre à la clé cible : %(lock)s != %(target)s
pt_br: A chave de bloqueio deve corresponder à chave de destino: %(lock)s !=%(target)s

source: Malformed endpoint URL (%(endpoint)s), see ERROR log for details.
es: URL de punto final formado incorrectamente (%(endpoint)s), vea el registro de ERROR para obtener detalles.
fr: URL de nœud final incorrectement formée (%(endpoint)s), consultez le journal des ERREURS pour plus de détails.
pt_br: URL de terminal mal-formada (%(endpoint)s), consulte o log ERROR para obter detalhes.

source: Marker could not be found
es: No se ha podido encontrar el marcador
fr: Le marqueur est introuvable
pt_br: O marcador não pôde ser encontrado

source: Max hierarchy depth reached for %s branch.
es: Se ha alcanzado la profundidad máxima de jerarquía en la rama %s.
fr: La profondeur maximale de hiérarchie est atteinte pour la branche %s.
pt_br: Profundidade máx. de hierarquia atingida para a ramificação %s.

source: Maximum lock attempts on %s occurred.
es: Se han producido el máximo de intentos de bloqueo en %s.
fr: Le nombre maximal de tentatives de verrouillage sur %s est atteint.
pt_br: Máximo de tentativas de bloqueio em %s ocorreu.

source: Member %(member)s is already a member of group %(group)s
es: El miembro %(member)s ya es miembro del grupo %(group)s
fr: Le membre %(member)s est déjà membre du groupe %(group)s
pt_br: O membro %(member)s já é membro do grupo %(group)s

source: Method not callable: %s
es: Método no invocable: %s
fr: Impossible d'appeler la méthode : %s
pt_br: O método não pode ser chamado: %s

source: Missing entity ID from environment
es: Falta el ID de entidad del entorno
fr: IP d'entité absent de l'environnement
pt_br: ID da entidade ausente a partir do ambiente

source: Modifying "redelegation_count" upon redelegation is forbidden. Omitting this parameter is advised.
es: La modificación de "redelegation_count" tras la redelegación está prohibida. Se recomienda omitir este parámetro.
fr: La modification de "redelegation_count" lors de la redélégation est interdite. Il est conseillé d'omettre ce paramètre.
pt_br: A modificação de "redelegation_count" na nova delegação é proibida. É recomendado omitir este parâmetro.

source: Multiple domains are not supported
es: No se admiten varios dominios
fr: Les domaines multiples ne sont pas pris en charge
pt_br: Múltiplos domínios não são suportados

source: Must be called within an active lock context.
es: Se debe invocar dentro de un contexto de bloqueo activo.
fr: Doit être appelé au sein d'un contexte de verrouillage actif.
pt_br: Deve ser chamado dentro de um contexto de bloqueio ativo.

source: Must specify either domain or project
es: Debe especificar dominio o proyecto, pero no ambas cosas a la vez
fr: Indiquez un domaine ou un projet
pt_br: Deve especificar o domínio ou projeto

source: Name field is required and cannot be empty
es: El nombre de campo es obligatorio y no puede estar vacío
fr: Le champ de nom est obligatoire et ne peut pas être vide
pt_br: O campo Nome é obrigatório e não pode ficar vazio

source: Neither Project Domain ID nor Project Domain Name was provided.
es: No se ha proporcionado el ID de dominio de proyecto ni el nombre de dominio de proyecto.
fr: Aucun ID ou nom de domaine de projet n'a été fourni.
pt_br: Nem o ID do Domínio do Projeto nem o Nome do Domínio do Projeto foi fornecido.

source: No Authorization headers found, cannot proceed with OAuth related calls, if running under HTTPd or Apache, ensure WSGIPassAuthorization is set to On.
es: No se han encontrado cabeceras de autorización, no se puede continuar con las llamadas relacionadas OAuth, si se están ejecutando bajo HTTPd o Apache, asegúrese de que WSGIPassAuthorization se establece en activada.
fr: Aucun en-tête d'autorisation trouvé, impossible de procéder aux appels liés à OAuth, en cas d'exécution sous HTTPd ou Apache, vérifiez que WSGIPassAuthorization est défini sur Activé.
pt_br: Nenhum cabeçalho de autorização foi localizado; não é possível continuar com chamadas relacionadas OAuth. Se estiver executando sob HTTPd ou Apache, certifique-se de que WSGIPassAuthorization esteja configurado para Ligado.

source: No authenticated user
es: No hay ningún usuario autenticado
fr: Aucun utilisateur authentifié
pt_br: Nenhum usuário autenticado

source: No encryption keys found; run keystone-manage fernet_setup to bootstrap one.
es: No se han encontrado claves de cifrado; ejecute keystone-manage fernet_setup en el programa de arranque uno.
fr: Aucune clé de chiffrement trouvée ; exécutez keystone-manage fernet_setup pour en amorcer une.
pt_br: Nenhuma chave de criptografia localizada; execute keystone-manage fernet_setup para autoinicializar uma.

source: No options specified
es: No se han especificado opciones
fr: Aucune option spécifiée
pt_br: Nenhuma opção especificada

source: No policy is associated with endpoint %(endpoint_id)s.
es: No hay ninguna política asociada con el punto final %(endpoint_id)s.
fr: Aucune stratégie n'est associée au nœud final %(endpoint_id)s.
pt_br: Nenhuma política associada ao terminal %(endpoint_id)s.

source: No remaining uses for trust: %(trust_id)s
es: No quedan usos para la confianza: %(trust_id)s
fr: Aucune utilisation restante pour la confiance : %(trust_id)s
pt_br: Nenhum uso restante para confiança: %(trust_id)s

source: No token in the request
es: No hay ningún token en la solicitud
fr: Aucun jeton dans la demande
pt_br: Não existe token na solicitação.

source: Non-default domain is not supported
es: El dominio no predeterminado no está soportado
fr: Le domaine non par défaut n'est pas pris en charge
pt_br: O domínio não padrão não é suportado

source: One of the trust agents is disabled or deleted
es: Uno de los agentes de confianza está inhabilitado o se ha suprimido
fr: L'un des agents de confiance est désactivé ou supprimé
pt_br: Um dos agentes de confiança está desativado ou excluído

source: Option %(option)s found with no group specified while checking domain configuration request
es: Se ha encontrado la opción %(option)s sin un grupo especificado al comprobar la solicitud de configuración del dominio
fr: Option %(option)s trouvée sans aucun groupe spécifié lors de la vérification de la demande de configuration du domaine
pt_br: Opção %(option)s localizada sem grupo especificado durante a verificação de solicitação de configuração de domínio

source: Option %(option)s in group %(group)s is not supported for domain specific configurations
es: No se admite la opción %(option)s del grupo %(group)s para configuraciones específicas de dominio
fr: L'option %(option)s dans le groupe %(group)s n'est pas prise en charge pour les configurations spécifiques à un domaine
pt_br: A opção %(option)s no grupo %(group)s não é suportada para configurações específicas de domínio

source: Project (%s)
es: Proyecto (%s)
fr: Projet (%s)
pt_br: Projeto (%s)

source: Project ID not found: %(t_id)s
es: No se ha encontrado el ID de proyecto : %(t_id)s
fr: ID de projet non trouvé : %(t_id)s
pt_br: ID de projeto não encontrado: %(t_id)s

source: Project field is required and cannot be empty.
es: El campo de proyecto es obligatorio y no puede estar vacío.
fr: La zone Projet est requise et ne doit pas être vide.
pt_br: O campo projeto é necessário e não pode ficar vazio.

source: Project is disabled: %s
es: El proyecto %s está inhabilitado
fr: Le projet est désactivé : %s
pt_br: O projeto está desativado: %s

source: Project name cannot contain reserved characters.
es: El nombre de proyecto no puede contener caracteres reservados.
fr: Le nom de projet ne peut pas contenir des caractères réservés.
pt_br: O nome do projeto não pode conter caracteres reservados.

source: Query string is not UTF-8 encoded
es: La cadena de consulta no está en UTF-8
fr: La chaine de requête n'est pas au format UTF-8.
pt_br: A sequência de consulta não está codificada em UTF-8

source: Reading the default for option %(option)s in group %(group)s is not supported
es: No se da soporte para leer el valor predeterminado para la opción %(option)s del grupo %(group)s
fr: La lecture de la valeur par défaut pour l'option %(option)s dans le groupe %(group)s n'est pas prise en charge
pt_br: Não é suportado ler o padrão para a opção %(option)s no grupo %(group)s

source: Redelegation allowed for delegated by trust only
es: Solo se permite volver a delegar un delegado por confianza
fr: Redélégation autorisée pour une délégation par fiducie uniquement
pt_br: Nova delegação permitida para delegado somente pelo fiador

source: Remaining redelegation depth of %(redelegation_depth)d out of allowed range of [0..%(max_count)d]
es: La profundidad de redelegación restante de %(redelegation_depth)d está fuera del rango permitido de [0..%(max_count)d]
fr: Profondeur de redélégation restante %(redelegation_depth)d par rapport à la plage admise [0..%(max_count)d]
pt_br: Profundidade da nova delegação restante do %(redelegation_depth)d fora do intervalo permitido de [0..%(max_count)d]

source: Remove admin_crud_extension from the paste pipeline, the admin_crud extension is now always available. Updatethe [pipeline:admin_api] section in keystone-paste.ini accordingly, as it will be removed in the O release.
es: Elimine admin_crud_extension de la interconexión de pegar, la extensión admin_crud ahora está siempre disponible. Actualice la sección [pipeline:admin_api] en keystone-paste.ini consecuentemente, ya que se eliminará en el release O.
fr: Supprimez admin_crud_extension du pipeline de collage, l'extension admin_crud est désormais toujours disponible. Mettez à jour la section [pipeline:admin_api] dans le fichier keystone-paste.ini en conséquence, car elle sera supprimée dans l'édition O.
pt_br: Remova a admin_crud_extension do pipeline de colagem, já que a extensão admin_crud agora está sempre disponível. Atualize a seção [pipeline:admin_api] no keystone-paste.ini de acordo, já que ela será removida da liberação O.

source: Remove endpoint_filter_extension from the paste pipeline, the endpoint filter extension is now always available. Update the [pipeline:api_v3] section in keystone-paste.ini accordingly as it will be removed in the O release.
es: Elimine endpoint_filter_extension de la interconexión de pegar, la extensión de filtro de punto final ahora está siempre disponible. Actualice la sección [pipeline:api_v3] en keystone-paste.ini consecuentemente, ya que se eliminará en el release O.
fr: Supprimez endpoint_filter_extension du pipeline de collage, l'extension du filtre de nœud final est désormais toujours disponible. Mettez à jour la section [pipeline:api_v3] dans le fichier keystone-paste.ini en conséquence car elle sera supprimée dans l'édition O.
pt_br: Remova a endpoint_filter_extension do pipeline de colagem, já que a extensão de filtro de terminal agora está sempre está disponível. Atualize a seção [pipeline:api_v3] no keystone-paste.ini de acordo, já que ela será removida da liberação O.

source: Remove federation_extension from the paste pipeline, the federation extension is now always available. Update the [pipeline:api_v3] section in keystone-paste.ini accordingly, as it will be removed in the O release.
es: Elimine federation_extension de la interconexión de pegar, la extensión de federación ahora está siempre disponible. Actualice la sección [pipeline:api_v3] en keystone-paste.ini consecuentemente, ya que se eliminará en el release O.
fr: Supprimez federation_extension du pipeline de collage, l'extension de fédération est désormais toujours disponible. Mettez à jour la section [pipeline:api_v3] dans le fichier keystone-paste.ini en conséquence, car elle sera supprimée dans l'édition O.
pt_br: Remova a federation_extension do pipeline de colagem, já que a extensão de federação agora está sempre está disponível. Atualize a seção [pipeline:api_v3] no keystone-paste.ini de acordo, já que ela será removida da liberação O.

source: Remove oauth1_extension from the paste pipeline, the oauth1 extension is now always available. Update the [pipeline:api_v3] section in keystone-paste.ini accordingly, as it will be removed in the O release.
es: Elimine oauth1_extension de la interconexión de pegar, la extensión oauth1 ahora está siempre disponible. Actualice la sección [pipeline:api_v3] en keystone-paste.ini consecuentemente, ya que se eliminará en el release O.
fr: Supprimez oauth1_extension du pipeline de collage, l'extension oauth1 est désormais toujours disponible. Mettez à jour la section [pipeline:api_v3] dans le fichier keystone-paste.ini en conséquence, car elle sera supprimée dans l'édition O.
pt_br: Remova oauth1_extension do pipeline de colagem, já que a extensão oauth1 agora está sempre está disponível. Atualize a seção [pipeline:api_v3] no keystone-paste.ini de acordo, já que ela será removida da liberação O.

source: Remove revoke_extension from the paste pipeline, the revoke extension is now always available. Update the [pipeline:api_v3] section in keystone-paste.ini accordingly, as it will be removed in the O release.
es: Elimine revoke_extension de la interconexión de pegar, la extensión de revocación ahora está siempre disponible. Actualice la sección [pipeline:api_v3] en keystone-paste.ini consecuentemente, ya que se eliminará en el release O.
fr: Supprimez revoke_extension du pipeline de collage, l'extension revoke est désormais toujours disponible. Mettez à jour la section [pipeline:api_v3] dans le fichier keystone-paste.ini en conséquence, car elle sera supprimée dans l'édition O.
pt_br: Remova revoke_extension do pipeline de colagem, já que a extensão de revogação agora está sempre está disponível. Atualize a seção [pipeline:api_v3] no keystone-paste.ini de acordo, já que ela será removida da liberação O.

source: Remove simple_cert from the paste pipeline, the PKI and PKIz token providers are now deprecated and simple_cert was only used insupport of these token providers. Update the [pipeline:api_v3] section in keystone-paste.ini accordingly, as it will be removed in the O release.
es: Elimine simple_cert de la interconexión de pegar, los proveedores de token PKI y PKIz están ahora en desuso y simple_cert se utilizaba únicamente para dar soporte a estos proveedores de token. Actualice la sección [pipeline:api_v3] en keystone-paste.ini consecuentemente, ya que se eliminará en el release O.
fr: Supprimez simple_cert du pipeline de collage, les fournisseurs de jetons PKI et PKIz sont désormais obsolètes et simple_cert n'a été utilisé que pour la prise en charge de ces fournisseurs. Mettez à jour la section [pipeline:api_v3] dans le fichier keystone-paste.ini en conséquence, car elle sera supprimée dans l'édition O.
pt_br: Remova simple_cert do pipeline de colagem, já que os provedores PKI e PKIz estão agora descontinuados e simple_cert era usado somente em suporte a esses provedores de token. Atualize a seção [pipeline:api_v3] no keystone-paste.ini de acordo, já que ela será removida da liberação O.

source: Remove user_crud_extension from the paste pipeline, the user_crud extension is now always available. Updatethe [pipeline:public_api] section in keystone-paste.ini accordingly, as it will be removed in the O release.
es: Elimine user_crud_extension de la interconexión de pegar, la extensión user_crud ahora está siempre disponible. Actualice la sección [pipeline:public_api] en keystone-paste.ini consecuentemente, ya que se eliminará en el release O.
fr: Supprimez user_crud_extension du pipeline de collage, l'extension user_crud est désormais toujours disponible. Mettez à jour la section [pipeline:public_api] dans le fichier keystone-paste.ini en conséquence, car elle sera supprimée de l'édition O.
pt_br: Remova a user_crud_extension do pipeline de colagem, já que a extensão user_crud agora está sempre disponível. Atualize a seção [pipeline:public_api] no keystone-paste.ini de acordo, já que ela será removida da liberação O.

source: Request Token does not have an authorizing user id
es: El token de solicitud no tiene un id de usuario de autorización
fr: Le jeton de demande ne comporte pas d'ID utilisateur d'autorisation
pt_br: O Token de Solicitação não possui um ID de usuário autorizado

source: Request attribute %(attribute)s must be less than or equal to %(size)i. The server could not comply with the request because the attribute size is invalid (too large). The client is assumed to be in error.
es: El atributo de solicitud %(attribute)s debe ser menor que o igual a %(size)i. El servidor no pudo satisfacer la solicitud porque el tamaño del atributo no es válido (demasiado grande). Se entiende que el cliente da error.
fr: La valeur de l'attribut de demande %(attribute)s doit être inférieure ou égale à %(size)i. Le serveur n'a pas pu se conformer à la demande car la taille de l'attribut n'est pas valide. Le client est considéré comme étant à l'état d'erreur.
pt_br: O atributo de solicitação %(attribute)s deve ser menor ou igual a %(size)i. O servidor não pôde atender à solicitação porque o tamanho do atributo é inválido (muito grande). Supõe-se que o cliente está em erro.

source: Request must have an origin query parameter
es: La solicitud debe tener un parámetro de consulta de origen
fr: La demande doit avoir un paramètre de requête d'origine
pt_br: A solicitação deve ter um parâmetro de consulta de origem

source: Request token is expired
es: El token solicitado ha caducado
fr: Le jeton de la demande a expiré
pt_br: O token de solicitação expirou

source: Request token not found
es: No se ha encontrado el token solicitado
fr: Jeton de demande non trouvé
pt_br: Token de solicitação não encontrado

source: Requested expiration time is more than redelegated trust can provide
es: El tiempo de caducidad solicitado es mayor que el que puede proporcionar la confianza redelegada
fr: Le délai d'expiration demandé dépasse celui que la fiducie redéléguée peut fournir
pt_br: Prazo de expiração solicitado é maior do que a confiança delegada novamente pode fornecer

source: Requested redelegation depth of %(requested_count)d is greater than allowed %(max_count)d
es: La profundidad de redelegación solicitada de %(requested_count)d es mayor que la permitida %(max_count)d
fr: La profondeur de redélégation demandée %(requested_count)d est supérieure à la limite autorisée %(max_count)d
pt_br: Profundidade da nova delegação solicitada de %(requested_count)d é maior que a %(max_count)d permitida

source: Running keystone via eventlet is deprecated as of Kilo in favor of running in a WSGI server (e.g. mod_wsgi). Support for keystone under eventlet will be removed in the "M"-Release.
es: La ejecución de keystone a través de eventlet está en desuso a partir de Kilo sustituyéndose por la ejecución en un servidor WSGI (por ejemplo, mod_wsgi). El soporte para keystone en eventlet se eliminará en el release "M".
fr: L'exécution de Keystone via eventlet est obsolète depuis Kilo et remplacée par l'exécution sur un serveur WSGI (par exemple, mod_wsgi). La prise en charge pour Keystone sous l'eventlet sera supprimée dans "M"-Release.
pt_br: Executar o keystone via eventlet foi descontinuado a partir do Kilo a favor de executar em um servidor WSGI (por exemplo, mod_wsgi). Suporte para o keystone sob eventlet será removido no "M"-Release.

source: Scoping to both domain and project is not allowed
es: No se permite definir el ámbito tanto a dominio como a proyecto
fr: La configuration du domaine et du projet n'est pas autorisée
pt_br: A definição de escopo para o domínio e o projeto não é permitida

source: Scoping to both domain and trust is not allowed
es: No se permite definir el ámbito tanto a dominio como a confianza
fr: La configuration du domaine et du certificat de confiance n'est pas autorisée
pt_br: A definição de escopo para o domínio e confiança não é permitida

source: Scoping to both project and trust is not allowed
es: No se permite definir el ámbito tanto a proyecto como a confianza
fr: La configuration du projet et du certificat de confiance n'est pas autorisée
pt_br: A definição de escopo para o projeto e a confiança não é permitida

source: Service Provider %(sp)s is disabled
es: El proveedor de servicios %(sp)s está inhabilitado
fr: Le fournisseur de services %(sp)s est désactivé
pt_br: O Provedor de Serviços %(sp)s está desativado

source: Some of requested roles are not in redelegated trust
es: Algunos roles solicitados no están en la confianza redelegada
fr: Certains rôles demandés ne font pas partie de la fiducie redéléguée
pt_br: Algumas funções solicitadas não estão na confiança da nova delegação

source: Specify a domain or project, not both
es: Especifique un dominio o un proyecto, no ambas cosas a la vez
fr: Indiquez un domaine ou un projet, mais pas les deux
pt_br: Especifique um domínio ou projeto, não ambos

source: Specify a user or group, not both
es: Especifique un usuario o un grupo, no ambas cosas a la vez
fr: Indiquez un utilisateur ou un groupe, mais pas les deux
pt_br: Especifique um usuário ou grupo, não ambos

source: Specify one of domain or project
es: Especifique un dominio o un proyecto
fr: Indiquez un domaine ou un projet
pt_br: Especifique um domínio ou projeto

source: Specify one of user or group
es: Especifique un usuario o un grupo
fr: Indiquez un utilisateur ou un groupe
pt_br: Especifique um usuário ou grupo

source: String length exceeded.The length of string '%(string)s' exceeded the limit of column %(type)s(CHAR(%(length)d)).
es: Se ha superado la longitud de la cadena. La longitud de la cadena '%(string)s' ha excedido el límite de la columna %(type)s(CHAR(%(length)d)).
fr: Longueur de chaîne dépassée. La longueur de la chaîne '%(string)s a dépassé la limite de la colonne %(type)s(CHAR(%(length)d)).
pt_br: Comprimento de sequência excedido. O comprimento de sequência '%(string)s' excedeu o limite da coluna %(type)s(CHAR(%(length)d)).

source: Tenant name cannot contain reserved characters.
es: El nombre de arrendatario no puede contener caracteres reservados.
fr: Le nom de locataire ne peut pas contenir des caractères réservés.
pt_br: O nome do locatário não pode conter caracteres reservados.
