Repository: jixianbo/openstack-mitaka
Catalog: keystone/locale/*/LC_MESSAGES/keystone.po
Languages: es, fr, pt_br

source: Could not find mapping: %(mapping_id)s
es: No se ha podido encontrar la correlación: %(mapping_id)s
fr: Impossible de trouver le mappage : %(mapping_id)s
pt_br: Não foi possível localizar o mapeamento: %(mapping_id)s

source: Could not find policy association
es: No se ha encontrado la asociación de política
fr: Association de stratégie introuvable
pt_br: Não foi possível localizar a associação de política

source: Could not find policy: %(policy_id)s
es: No se ha podido encontrar : %(policy_id)s
fr: Impossible de trouver la stratégie : %(policy_id)s
pt_br: Não foi possível localizar a política: %(policy_id)s

source: Could not find project: %(project_id)s
es: No se ha podido encontrar el proyecto: %(project_id)s
fr: Impossible de trouver le projet : %(project_id)s
pt_br: Não foi possível localizar o projeto: %(project_id)s

source: Could not find region: %(region_id)s
es: No se ha podido encontrar la región: %(region_id)s
fr: Impossible de trouver la région : %(region_id)s
pt_br: Não foi possível localizar a região: %(region_id)s

source: Could not find role assignment with role: %(role_id)s, user or group: %(actor_id)s, project or domain: %(target_id)s
es: No se ha podido encontrar la asignación de roles con el rol: %(role_id)s, usuario o grupo: %(actor_id)s, proyecto o dominio: %(target_id)s
fr: Impossible de trouver l'affectation de rôle avec le rôle : %(role_id)s, utilisateur ou groupe : %(actor_id)s, projet ou domaine : %(target_id)s
pt_br: Não foi possível localizar a designação de função com a função: %(role_id)s, usuário ou grupo: %(actor_id)s, projeto ou domínio: %(target_id)s

source: Could not find role: %(role_id)s
es: No se ha podido encontrar el rol: %(role_id)s
fr: Impossible de trouver le rôle : %(role_id)s
pt_br: Não foi possível localizar a função: %(role_id)s

source: Could not find service: %(service_id)s
es: No se ha podido encontrar el servicio: %(service_id)s
fr: Impossible de trouver le service : %(service_id)s
pt_br: Não foi possível localizar o serviço: %(service_id)s

source: Could not find token: %(token_id)s
es: No se ha podido encontrar el token: %(token_id)s
fr: Impossible de trouver le jeton : %(token_id)s
pt_br: Não foi possível localizar o token: %(token_id)s

source: Could not find trust: %(trust_id)s
es: No se ha podido encontrar la confianza: %(trust_id)s
fr: Impossible de trouver la confiance : %(trust_id)s
pt_br: Não foi possível localizar a confiança: %(trust_id)s

source: Could not find user: %(user_id)s
es: No se ha podido encontrar el usuario: %(user_id)s
fr: Impossible de trouver l'utilisateur : %(user_id)s
pt_br: Não foi possível localizar o usuário: %(user_id)s

source: Could not find version: %(version)s
es: No se ha podido encontrar la versión: %(version)s
fr: Impossible de trouver la version : %(version)s
pt_br: Não foi possível localizar a versão: %(version)s

source: Could not find: %(target)s
es: No se ha podido encontrar : %(target)s
fr: Impossible de trouver : %(target)s
pt_br: Não foi possível localizar: %(target)s

source: Could not map any federated user properties to identity values. Check debug logs or the mapping used for additional details.
es: No se ha podido correlacionar ninguna propiedad de usuario federado a valor de identidad. Compruebe los registros de depuración o la correlación utilizada para obtener información más detallada.
fr: Impossible de mapper des propriétés d'utilisateur fédéré à des valeurs d'identité. Pour plus d'informations, consultez les journaux de débogage ou le mappage utilisé.
pt_br: Não foi possível mapear nenhuma propriedade do usuário federado para valores de identidade. Verifique os logs de depuração ou o mapeamento usado para obter detalhes adicionais

source: Could not map user while setting ephemeral user identity. Either mapping rules must specify user id/name or REMOTE_USER environment variable must be set.
es: No se ha podido correlacionar el usuario al establecer la identidad de usuario efímera. Las reglas de correlación deben especificar ID/nombre de usuario o se debe establecer la variable de entorno REMOTE_USER.
fr: Impossible de mapper l'utilisateur lors de la définition de l'identité utilisateur éphémère. Des règles de mappage doivent spécifier l'ID utilisateur/le nom ou la variable d'environnement REMOTE_USER doit être définie.
pt_br: Não foi possível mapear o usuário ao configurar a identidade do usuário efêmera. As regras de mapeamento devem especificar o ID/nome do usuário ou a variável de ambiente REMOTE_USER deve ser configurada.

source: Could not validate the access token
es: No se ha podido validar el token de acceso
fr: Impossible de valider le jeton d'accès
pt_br: Não foi possível validar o token de acesso

source: Credential belongs to another user
es: La credencial pertenece a otro usuario
fr: Les données d'identification appartiennent à un autre utilisateur
pt_br: A credencial pertence a outro usuário

source: Credential signature mismatch
es: Discrepancia en la firma de credencial
fr: Non concordance de signature des données d'identification
pt_br: Incompatibilidade de assinatura de credencial

source: Direct import of auth plugin %(name)r is deprecated as of Liberty in favor of its entrypoint from %(namespace)r and may be removed in N.
es: La importación directa del plugin de autorización %(name)r está en desuso a partir de Liberty, sustituyéndose por su punto de entrada desde %(namespace)r y puede que se elimine en N.
fr: L'importation directe du plug-in d'authentification %(name)r est obsolète depuis Liberty en faveur de son point d'entrée depuis %(namespace)r et susceptible d'être supprimée dans N.
pt_br: A importação direta de um plug-in de autoria %(name)r foi descontinuada a partir do Liberty a favor de seu ponto de entrada de %(namespace)r e pode ser removida no N.

source: Direct import of driver %(name)r is deprecated as of Liberty in favor of its entrypoint from %(namespace)r and may be removed in N.
es: La importación directa del controlador %(name)r está en desuso a partir de Liberty, sustituyéndose por su punto de entrada desde %(namespace)r y puede que se elimine en N.
fr: L'importation directe du pilote %(name)r est obsolète depuis Liberty en faveur de son point d'entrée depuis %(namespace)r et susceptible d'être supprimée dans N.
pt_br: A importação direta de um driver %(name)r foi descontinuada a partir do Liberty a favor de seu ponto de entrada de %(namespace)r e pode ser removida no N.

source: Disabling an entity where the 'enable' attribute is ignored by configuration.
es: Inhabilitando una entidad donde el atributo 'enable' se omite en la configuración.
fr: Désactivation d'une entité dont l'attribut 'enable' est ignoré par la configuration.
pt_br: A desativação de uma entidade em que o atributo ‘enable' é ignorado pela configuração.

source: Domain (%s)
es: Dominio (%s)
fr: Domaine (%s)
pt_br: Domínio (%s)

source: Domain cannot be named %s
es: No se puede invocar al dominio %s
fr: Le domaine ne peut pas s'appeler %s
pt_br: O domínio não pode ser chamado %s

source: Domain cannot have ID %s
es: El dominio no puede tener el ID %s
fr: Le domaine ne peut pas avoir l'ID %s
pt_br: O domínio não pode ter o ID de %s

source: Domain is disabled: %s
es: El dominio %s está inhabilitado
fr: Domaine désactivé : %s
pt_br: O domínio está desativado: %s

source: Domain name cannot contain reserved characters.
es: El nombre de dominio no puede contener caracteres reservados.
fr: Le nom de domaine ne peut pas contenir des caractères réservés.
pt_br: O nome do domínio não pode conter caracteres reservados.

source: Domain scoped token is not supported
es: No se da soporte a tokens con ámbito de dominio
fr: Le jeton configuré du domaine n'est pas pris en charge
pt_br: O token de escopo de domínio não é suportado

source: Domain specific roles are not supported in the V8 role driver
es: El controlador de roles V8 no admite roles específicos de dominio.
fr: Les rôles spécifiques au domaine ne sont pas pris en charge dans le pilote de rôle V8
pt_br: Funções específicas de domínio não são suportadas no driver de função da V8

source: Domain: %(domain)s already has a configuration defined - ignoring file: %(file)s.
es: El dominio: %(domain)s ya tiene definida una configuración - se ignorará el archivo: %(file)s.
fr: Une configuration est déjà définie pour le domaine %(domain)s - fichier ignoré : %(file)s.
pt_br: O domínio: %(domain)s já possui uma configuração definida - ignorando arquivo: %(file)s.

source: Duplicate Entry
es: Entrada duplicada
fr: Entrée en double
pt_br: Entrada Duplicada

source: Duplicate ID, %s.
es: ID duplicado, %s.
fr: ID en double, %s.
pt_br: ID duplicado, %s.

source: Duplicate entry: %s
es: Entrada duplicada: %s
fr: Entrée en double : %s
pt_br: Entrada duplicada: %s

source: Duplicate name, %s.
es: Nombre duplicado, %s.
fr: Nom en double, %s.
pt_br: Nome duplicado, %s.

source: Duplicate remote ID: %s
es: ID remoto duplicado: %s
fr: ID distant en double : %s
pt_br: ID remoto duplicado: %s

source: EC2 access key not found.
es: No se ha encontrado la clave de acceso de EC2.
fr: Clé d'accès EC2 non trouvée.
pt_br: Chave de acesso EC2 não encontrada.

source: EC2 signature not supplied.
es: No se ha proporcionado la firma de EC2.
fr: Signature EC2 non fournie.
pt_br: Assinatura EC2 não fornecida.

source: Either --bootstrap-password argument or OS_BOOTSTRAP_PASSWORD must be set.
es: Se debe definir el argumento bootstrap-password o bien OS_BOOTSTRAP_PASSWORD.
fr: L'argument --bootstrap-password ou OS_BOOTSTRAP_PASSWORD doit être défini.
pt_br: O argumento de senha de autoinicialização ou OS_BOOTSTRAP_PASSWORD deve ser configurado.

source: Enabled field must be a boolean
es: El campo habilitado debe ser un booleano
fr: La zone activée doit être de type booléen
pt_br: O campo habilitado precisa ser um booleano

source: Enabled field should be a boolean
es: El campo habilitado debe ser un booleano
fr: La zone activée devrait être de type booléen
pt_br: O campo habilitado deve ser um booleano

source: Endpoint %(endpoint_id)s not found in project %(project_id)s
es: No se ha encontrado el punto final %(endpoint_id)s en el proyecto %(project_id)s
fr: Nœud final %(endpoint_id)s non trouvé dans le projet %(project_id)s
pt_br: Endpoint %(endpoint_id)s não encontrado no projeto %(project_id)s

source: Endpoint Group Project Association not found
es: No se ha encontrado la asociación de proyecto del grupo de puntos finales
fr: Association de projets du groupe de nœuds finaux non trouvée
pt_br: Associação de Projeto do Grupo do Terminal não localizada

source: Ensure configuration option idp_entity_id is set.
es: Compruebe que se haya establecido la opción de configuración idp_entity_id.
fr: Assurez-vous que l'option de configuration idp_entity_id est définie.
pt_br: Assegure-se de que a opção de configuração idp_entity_id esteja definida.

source: Ensure configuration option idp_sso_endpoint is set.
es: Compruebe que se haya establecido la opción de configuración idp_sso_endpoint.
fr: Assurez-vous que l'option de configuration idp_sso_endpoint est définie.
pt_br: Assegure-se de que a opção de configuração idp_sso_endpoint esteja definida.

source: Error parsing configuration file for domain: %(domain)s, file: %(file)s.
es: Error al analizar el archivo de configuración para el dominio: %(domain)s, archivo: %(file)s.
fr: Erreur lors de l'analyse syntaxique du fichier de configuration pour le domaine : %(domain)s, fichier : %(file)s.
pt_br: Erro ao analisar o arquivo de configuração para o domínio: %(domain)s, arquivo: %(file)s.

source: Error while opening file %(path)s: %(err)s
es: Error al abrir el archivo %(path)s: %(err)s
fr: Erreur lors de l'ouverture du fichier %(path)s : %(err)s
pt_br: Erro ao abrir arquivo %(path)s: %(err)s

source: Error while parsing line: '%(line)s': %(err)s
es: Error al analizar la línea: '%(line)s': %(err)s
fr: Erreur lors de l'analyse de la ligne : '%(line)s' : %(err)s
pt_br: Erro ao analisar a linha %(line)s: %(err)s

source: Error while parsing rules %(path)s: %(err)s
es: Error al analizar las reglas %(path)s: %(err)s
fr: Erreur lors de l'analyse syntaxique des règles %(path)s : %(err)s
pt_br: Erro ao analisar regras %(path)s: %(err)s

source: Error while reading metadata file, %(reason)s
es: Error al leer el archivo de metadatos, %(reason)s
fr: Erreur lors de la lecture du fichier de métadonnées du fichier, %(reason)s
pt_br: Erro ao ler arquivo de metadados, %(reason)s

source: Exceeded attempts to register domain %(domain)s to use the SQL driver, the last domain that appears to have had it is %(last_domain)s, giving up
es: Se ha superado el número máximo de intentos de registrar un dominio %(domain)s para utilizar el controlador SQL, el último dominio que parece haberlo tenido es %(last_domain)s, abandonando
fr: Nombre de tentatives d'enregistrement du domaine %(domain)s dépassé pour utiliser le pilote SQL, le dernier domaine qui semble l'avoir contenu est %(last_domain)s, abandon...
pt_br: Tentativas excedidas de registrar o domínio %(domain)s para usar SQL driver, o ultimo domínio que parece ter tido foi %(last_domain)s, desistindo

source: Expected dict or list: %s
es: Se espera un diccionario o una lista: %s
fr: Dictionnaire ou liste attendu : %s
pt_br: Esperado dict ou list: %s

source: Expected signing certificates are not available on the server. Please check Keystone configuration.
es: No hay los certificados para firmas esperados disponibles en el servidor. Compruebe la configuración de Keystone.
fr: Les certificats signataires attendus ne sont pas disponibles sur le serveur. Vérifiez la configuration de Keystone.
pt_br: Certificados de assinatura esperados não estão disponíveis no servidor. Verifique a configuração de Keystone.

source: Expecting to find %(attribute)s in %(target)s - the server could not comply with the request since it is either malformed or otherwise incorrect. The client is assumed to be in error.
es: Se esperaba encontrar %(attribute)s en %(target)s - el servidor no pudo satisfacer la solicitud porque está mal formada o es incorrecta por algún otro motivo. Se entiende que el cliente da error.
fr: En attente de recherche de %(attribute)s dans %(target)s - le serveur n'a pas pu se conformer à la demande car elle est incorrectement formée ou incorrecte. Le client est considéré comme étant à l'état d'erreur.
pt_br: Esperando localizar %(attribute)s em %(target)s - o servidor não pôde atender à solicitação porque ela está malformada ou de outra maneira incorreta. Supõe-se que o cliente está em erro.

source: Failed to start the %(name)s server
es: No se ha podido iniciar el servidor %(name)s
fr: Impossible de démarrer le serveur %(name)s
pt_br: Falha ao iniciar o servidor do %(name)s

source: Failed to validate token
es: Ha fallado la validación del token
fr: Échec de validation du jeton
pt_br: Falha ao validar token

source: Federation token is expired
es: El token de federación ha caducado
fr: Le jeton de fédération a expiré
pt_br: O token de federação está expirado

source: Field "remaining_uses" is set to %(value)s while it must not be set in order to redelegate a trust
es: El campo "remaining_uses" está establecido en %(value)s, pero no puede estar establecido para poder redelegar una confianza
fr: La zone "remaining_uses" est définie sur %(value)s alors qu'elle ne doit pas être définie pour redéléguer une fiducie
pt_br: O campo "remaining_uses" está configurado como %(value)s enquanto ele não deve ser configurado para delegar novamente uma confiança

source: Found invalid token: scoped to both project and domain.
es: Se ha encontrado un token no válido: se ha definido el ámbito a proyecto y dominio a la vez.
fr: Jeton non valide trouvé : configuré dans projet et domaine.
pt_br: Token inválido encontrado: escopo definido para o projeto e o domínio.

source: Group %s not found in config
es: No se ha encontrado el grupo %s en la configuración
fr: Groupe %s non trouvé dans la configuration
pt_br: Grupo %s não localizado na configuração

source: Group %(group)s is not supported for domain specific configurations
es: No se admite el grupo %(group)s para configuraciones específicas de dominio
fr: Le groupe %(group)s n'est pas pris en charge pour les configurations spécifiques à un domaine
pt_br: O grupo %(group)s não é suportado para configurações específicas do domínio

source: Group %(group_id)s returned by mapping %(mapping_id)s was not found in the backend.
es: El grupo %(group_id)s devuelto por la correlación %(mapping_id)s no se ha encontrado en el programa de fondo.
fr: Le groupe %(group_id)s renvoyé par le mappage %(mapping_id)s introuvable dans le back-end.
pt_br: O grupo %(group_id)s retornado pelo mapeamento %(mapping_id)s não foi localizado no backend.

source: Group membership across backend boundaries is not allowed, group in question is %(group_id)s, user is %(user_id)s
es: No se permite la pertenencia a grupos traspasando los límites del programa de fondo, el grupo en cuestión es %(group_id)s, el usuario es %(user_id)s
fr: L'appartenance de groupe entre frontières de back-end n'est pas autorisée, le groupe en question est %(group_id)s, l'utilisateur est %(user_id)s
pt_br: Associação ao grupo pelos limites de backend não é permitida, o grupo em questão é %(group_id)s, o usuário é %(user_id)s

source: ID attribute %(id_attr)s not found in LDAP object %(dn)s
es: No se ha encontrado el ID de atributo %(id_attr)s en el objeto LDAP %(dn)s
fr: L'attribut ID %(id_attr)s non trouvé dans l'objet LDAP %(dn)s
pt_br: Atributo do ID %(id_attr)s não localizado no objeto LDAP %(dn)s

source: Identity Provider %(idp)s is disabled
es: El proveedor de identidad %(idp)s está inhabilitado
fr: Le fournisseur d'identité %(idp)s est désactivé
pt_br: O Provedor de Identidade %(idp)s está desativado

source: Incoming identity provider identifier not included among the accepted identifiers.
es: No se ha incluido el identificador del proveedor de identidad de entrada entre los identificadores aceptados.
fr: L'identificateur de fournisseur d'identité entrant ne fait pas partie des identificateurs acceptés.
pt_br: O identificador do provedor de identidade recebido não está incluído entre os identificadores aceitos.

source: Invalid EC2 signature.
es: Firma de EC2 no válida.
fr: Signature EC2 non valide.
pt_br: Assinatura EC2 inválida.

source: Invalid LDAP TLS certs option: %(option)s. Choose one of: %(options)s
es: Opción de LDAP TLS no válida: %(option)s. Elegir una de las siguientes: %(options)s
fr: Option de certificat TLS LDAP non valide : %(option)s. Choisissez l'une des options suivantes : %(options)s
pt_br: Opção de certificados LADP TLS inválida: %(option)s. Escolha uma de: %(options)s

source: Invalid LDAP TLS_AVAIL option: %s. TLS not available
es: Opción LDAP TLS_AVAIL no válida: %s. TLS no disponible
fr: Option TLS_AVAIL LDAP non valide : %s. TLS non disponible
pt_br: Opção LDAP TLS_AVAIL inválida: %s. TLS não dsponível

source: Invalid LDAP deref option: %(option)s. Choose one of: %(options)s
es: Opción deref LDAP no válida: %(option)s. Elija una de las siguientes: %(options)s
fr: Option déréférencée LDAP non valide : %(option)s. Choisissez l'une des options suivantes : %(options)s
pt_br: Opção deref LDAP inválida: %(option)s. Escolha uma destas: %(options)s

source: Invalid LDAP scope: %(scope)s. Choose one of: %(options)s
es: Ámbito LDAP incorrecto: %(scope)s. Seleccione una de las siguientes opciones: %(options)s
fr: Portée LDAP non valide : %(scope)s. Choisissez l'une des portées suivantes : %(options)s
pt_br: Escopo LDAP inválido: %(scope)s. Escolha um de: %(options)s

source: Invalid TLS / LDAPS combination
es: Combinación de TLS/LDAPS no válida
fr: Combinaison TLS / LDAPS non valide
pt_br: Combinação TLS / LADPS inválida

source: Invalid audit info data type: %(data)s (%(type)s)
es: Tipo de datos de información de auditoría no válido: %(data)s (%(type)s)
fr: Type de données d'information d'audit non valide : %(data)s (%(type)s)
pt_br: Tipo de dados de informações de auditoria inválido: %(data)s (%(type)s)

source: Invalid blob in credential
es: Blob no válido en la credencial
fr: Objet LOB non valide dans les informations d'identification
pt_br: BLOB inválido na credencial

source: Invalid domain name: %(domain)s found in config file name: %(file)s - ignoring this file.
es: Se ha encontrado un nombre de dominio no válido: %(domain)s en el nombre del archivo de configuración: %(file)s - se ignorará este archivo.
fr: Nom de domaine non valide : %(domain)s trouvé dans le nom du fichier de configuration : %(file)s - fichier ignoré.
pt_br: Nome de domínio inválido: %(domain)s localizado no nome do arquivo de configuração: %(file)s - ignorando este arquivo.

source: Invalid domain specific configuration: %(reason)s
es: Configuración específica de dominio no válida: %(reason)s
fr: Configuration spécifique au domaine non valide : %(reason)s
pt_br: Configuração específica de domínio inválida: %(reason)s

source: Invalid input for field '%(path)s'. The value is '%(value)s'.
es: Entrada no válida para el campo '%(path)s'. El valor es '%(value)s'.
fr: Entrée non valide pour la zone '%(path)s'. La valeur est '%(value)s'.
pt_br: Entrada inválida para o campo '%(path)s'. O valor é '%(value)s'.

source: Invalid limit value
es: Valor de límite no válido
fr: Valeur de limite non valide
pt_br: Valor limite inválido

source: Invalid mix of entities for policy association - only Endpoint, Service or Region+Service allowed. Request was - Endpoint: %(endpoint_id)s, Service: %(service_id)s, Region: %(region_id)s
es: Combinación no válida de entidades para la asociación de políticas: solo se permite Punto final, Servicio o Región + Servicio. La solicitud era: Punto final: %(endpoint_id)s, Servicio: %(service_id)s, Región: %(region_id)s
fr: Combinaison d'entités non valide pour l'association de stratégie. Seules les entités Nœud final, Service ou Région+Service sont autorisées. La demande était Point final : %(endpoint_id)s, Service : %(service_id)s, Région : %(region_id)s
pt_br: Combinação de entidades inválida para associação de política - somente Terminal, Serviço ou Região+Serviço permitido. A solicitação foi - Terminal: %(endpoint_id)s, Serviço: %(service_id)s, Região: %(region_id)s

source: Invalid rule: %(identity_value)s. Both 'groups' and 'domain' keywords must be specified.
es: Regla no válida: %(identity_value)s. Se deben especificar las palabras clave 'groups' y 'domain'.
fr: Règle non valide : %(identity_value)s. Les mots clés 'groups' et 'domain' doivent être spécifiés.
pt_br: Regra inválida: %(identity_value)s. As palavras-chave 'groups' e 'domain' devem ser especificadas.

source: Invalid signature
es: Firma no válida
fr: Signature non valide
pt_br: Assinatura inválida

source: Invalid user / password
es: Usuario / contraseña no válidos
fr: Utilisateur / Mot de passe non valide
pt_br: Usuário / senha inválido

source: Invalid username or TOTP passcode
es: Nombre de usuario o código de acceso TOTP no válidos
fr: Nom d'utilisateur ou code TOTP non valide
pt_br: Nome de usuário ou passcode TOTP inválido

source: Invalid username or password
es: Usuario o contraseña no válidos
fr: Nom d'utilisateur ou mot de passe non valide
pt_br: Nome de usuário ou senha inválidos

source: KVS region %s is already configured. Cannot reconfigure.
es: La región KVS %s ya se ha configurado. No se puede volver a configurar.
fr: La région KVS %s est déjà configurée. Reconfiguration impossible.
pt_br: A região KVS %s já está configurada. Não é possível reconfigurar.

source: Key Value Store not configured: %s
es: Almacén de valor de clave no configurado: %s
fr: Magasin de valeurs de clé non configuré : %s
pt_br: Armazenamento do Valor da Chave não configurado: %s
