Repository: jixianbo/openstack-mitaka
Catalog: keystone/locale/*/LC_MESSAGES/keystone.po
Languages: es, fr, pt_br

source: %(driver)s is not supported driver version
es: %(driver)s es una versión de controlador no soportada
fr: %(driver)s n'est pas une version de pilote prise en charge
pt_br: O %(driver)s não é uma versão de driver suportada

source: %(entity)s name cannot contain the following reserved characters: %(chars)s
es: El nombre %(entity)s no puede contener los siguientes caracteres reservados: %(chars)s
fr: Le nom %(entity)s ne peut pas contenir les caractères réservés suivants : %(chars)s
pt_br: O nome %(entity)s não pode conter os caracteres reservados a seguir: %(chars)s

source: %(event)s is not a valid notification event, must be one of: %(actions)s
es: %(event)s no es un suceso de notificación válido, debe ser uno de: %(actions)s
fr: %(event)s n'est pas un événement de notification valide, ce doit être l'un des suivants : %(actions)s
pt_br: %(event)s não é um evento de notificação válido, deve ser um de: %(actions)s

source: %(host)s is not a trusted dashboard host
es: %(host)s no es un host de panel de control de confianza
fr: %(host)s n'est pas un hôte de tableau de bord digne de confiance
pt_br: %(host)s não é um host do painel confiável

source: %(mod_name)s doesn't provide database migrations. The migration repository path at %(path)s doesn't exist or isn't a directory.
es: %(mod_name)s no proporciona migración de base de datos. La vía de acceso de repositorio de migración en %(path)s no existe o no es un directorio.
fr: %(mod_name)s ne permet pas les migrations de base de données. Le chemin du référentiel de migration %(path)s n'existe pas ou n'est pas un répertoire.
pt_br: O %(mod_name)s não fornece migrações de banco de dados. O caminho do repositório de migração %(path)s não existe ou não é um diretório.

source: %(prior_role_id)s does not imply %(implied_role_id)s
es: %(prior_role_id)s no implica %(implied_role_id)s
fr: %(prior_role_id)s n'implique pas %(implied_role_id)s
pt_br: %(prior_role_id)s não implica %(implied_role_id)s

source: %(property_name)s cannot be less than %(min_length)s characters.
es: %(property_name)s no puede tener menos de %(min_length)s caracteres.
fr: %(property_name)s ne peut pas contenir moins de %(min_length)s caractères.
pt_br: %(property_name)s não pode ter menos de %(min_length)s caracteres.

source: %(property_name)s is not a %(display_expected_type)s
es: %(property_name)s no es %(display_expected_type)s
fr: %(property_name)s n'est pas un %(display_expected_type)s
pt_br: %(property_name)s não é um %(display_expected_type)s

source: %(property_name)s should not be greater than %(max_length)s characters.
es: %(property_name)s no debe tener más de %(max_length)s caracteres.
fr: %(property_name)s ne doit pas contenir plus de %(max_length)s caractères.
pt_br: %(property_name)s não deve ter mais de %(max_length)s caracteres.

source: %(role_id)s cannot be an implied roles
es: %(role_id)s no puede ser un rol implicado
fr: %(role_id)s ne peut pas être un rôle impliqué
pt_br: %(role_id)s não pode ser uma função implícita

source: %s cannot be empty.
es: %s no puede estar vacío.
fr: %s ne peut pas être vide.
pt_br: %s não pode ficar vazio.

source: %s extension does not exist.
es: La extensión %s no existe.
fr: L'extension %s n'existe pas.
pt_br: A extensão %s não existe.

source: %s field is required and cannot be empty
es: el campo %s es obligatorio y no puede estar vacío
fr: La zone %s est obligatoire et ne peut pas être vide
pt_br: O campo %s é obrigatório e não pode ficar vazio

source: %s field(s) cannot be empty
es: el campo %s no puede estar vacío
fr: la ou les zones %s ne peuvent pas être vides
pt_br: Os campos %s não podem ficar vazios

source: %s for the LDAP identity backend has been deprecated in the Mitaka release in favor of read-only identity LDAP access. It will be removed in the "O" release.
es: El programa de fondo de identidad LDAP %s se ha dejado en desuso en el release de Mitaka, sustituyéndolo por un acceso LDAP de identidad de solo lectura. Se eliminará en el release "O".
fr: %s pour le back-end d'identité LDAP est désormais obsolète dans l'édition Mitaka en faveur de l'accès LDAP d'identité en lecture seule. Il sera supprimé dans l'édition "O".
pt_br: %s para o backend de identidade LDAP foi descontinuado na liberação do Mitaka a favor do acesso LDAP de identidade somente leitura. Ele será removido na liberação "O".

source: (Disable insecure_debug mode to suppress these details.)
es: (Inhabilite la modalidad insecure_debug para suprimir estos detalles.)
fr: (Désactivez le mode insecure_debug pour supprimer ces détails.)
pt_br: (Desative o modo insecure_debug para suprimir esses detalhes).

source: --all option cannot be mixed with other options
es: La opción --all no puede mezclarse con otras opciones
fr: L'option -all ne peut pas être associée à d'autres options
pt_br: A opção --all não pode ser combinada com outras opções

source: A project-scoped token is required to produce a service catalog.
es: Se necesita un token con ámbito de proyecto para producir un catálogo de servicio.
fr: Un jeton de niveau projet est requis pour produire un catalogue de service.
pt_br: Um token de projeto com escopo é necessário para produzir um catálogo de serviços.

source: Access token is expired
es: El token de acceso ha caducado
fr: Le jeton d'accès a expiré
pt_br: O token de acesso expirou

source: Access token not found
es: No se ha encontrado el token de acceso
fr: Jeton d'accès non trouvé
pt_br: Token de acesso não encontrado

source: Additional authentications steps required.
es: Se precisan pasos adicionales de autenticación.
fr: Des étapes d'authentifications supplémentaires sont nécessaires .
pt_br: Passos de autenticação adicionais necessários.

source: An unexpected error occurred when retrieving domain configs
es: Se ha producido un error inesperado al recuperar las configuraciones de dominio
fr: Une erreur inattendue s'est produite lors de l'extraction des configurations de domaine
pt_br: Ocorreu um erro inesperado ao recuperar as configurações de domínio

source: An unexpected error occurred when trying to store %s
es: Se ha producido un error inesperado al intentar almacenar %s
fr: Une erreur inattendue s'est produite lors de la tentative de stockage de %s
pt_br: Ocorreu um erro inesperado ao tentar armazenar %s

source: An unexpected error prevented the server from fulfilling your request.
es: El servidor no ha podido completar su solicitud debido a un error inesperado.
fr: Une erreur inattendue a empêché le serveur de traiter votre demande.
pt_br: Um erro inesperado evitou que o servidor cumprisse sua solicitação.

source: An unexpected error prevented the server from fulfilling your request: %(exception)s
es: Un error inesperado a impedido que el servidor complete su solicitud: %(exception)s
fr: Une erreur inattendue a empêché le serveur de traiter votre demande : %(exception)s
pt_br: Um erro inesperado evitou que o servidor cumprisse sua solicitação: %(exception)s

source: An unhandled exception has occurred: Could not find metadata.
es: Se ha producido una excepción no controlada: no se han podido encontrar los metadatos.
fr: Une exception non gérée s'est produite : métadonnées introuvables.
pt_br: Ocorreu uma exceção não manipulada: Não foi possível encontrar metadados.

source: At least one option must be provided
es: Se debe especificar al menos una opción
fr: Au moins une option doit être fournie
pt_br: Pelo menos uma opção deve ser fornecida

source: At least one option must be provided, use either --all or --domain-name
es: Debe proporcionarse al menos una opción, utilice --all o --domain-name
fr: Au moins une option doit être indiquée ; utilisez --all ou --domain-name
pt_br: Pelo menos uma opção deve ser fornecida, use --all ou --domain-name

source: At least one role should be specified.
es: Se debe especificar al menos un rol
fr: Au moins un rôle doit être indiqué.
pt_br: Pelo menos um papel deve ser especificado.

source: Attempted automatic driver selection for assignment based upon [identity]\driver option failed since driver %s is not found. Set [assignment]/driver to a valid driver in keystone config.
es: Se ha intentado la seleción automática de controlador para la asignación en base a la opción [identity]\driver, pero ha fallado porque no se encuentra el controlador %s. Defina [assignment]/driver con un controlador válido en la configuración de keystone.
fr: La tentative de sélection du pilote automatique pour l'affectation basée sur l'option [identity]\driver a échoué car le pilote %s est introuvable. Définissez l'option [assignment]/driver sur un pilote valide dans la configuration Keystone.
pt_br: Uma tentativa de seleção de driver automática para designação com base na opção [identity]\driver falhou porque o driver %s não foi localizado. Configure o [assignment]/driver para um driver válido na configuração do keystone.

source: Attempted to authenticate with an unsupported method.
es: Se ha intentado autenticar con un método no compatible.
fr: Tentative d'authentification avec une méthode non prise en charge .
pt_br: Tentativa de autenticação com um método não suportado.

source: Attempting to use OS-FEDERATION token with V2 Identity Service, use V3 Authentication
es: Intentando utilizar el token OS-FEDERATION con el servicio de identidad V2, utilice la autenticación V3 .
fr: Tentative d'utilisation du jeton OS-FEDERATION avec V2 Identity Service, utilisez l'authentification V3
pt_br: Ao tentar usar o token OS-FEDERATION com Serviço de identidade V2, use autenticação V3

source: Authentication plugin error.
es: Error en el plugin de autenticación
fr: Erreur du plug-in d'authentification.
pt_br: Erro do plugin de autenticação.

source: Backend `%(backend)s` is not a valid memcached backend. Valid backends: %(backend_list)s
es: El programa de fondo `%(backend)s` no es un programa de fondo almacenado en caché válido. Programas de fondo válidos: %(backend_list)s
fr: Le back-end `%(backend)s` n'est pas un back-end memcached valide. Back-ends valides : %(backend_list)s
pt_br: O backend `%(backend)s`não é um backend memcached válido. Backends válidos: %(backend_list)s

source: Cannot authorize a request token with a token issued via delegation.
es: No se puede autorizar una señal de solicitud con una señal emitida mediante delegación.
fr: Impossible d'autoriser un jeton de demande avec un jeton émis via une délégation.
pt_br: Não é possível autorizar um token de solicitação com um token emitido por meio de delegação.

source: Cannot change %(option_name)s %(attr)s
es: No se puede cambiar %(option_name)s %(attr)s
fr: Impossible de modifier %(option_name)s %(attr)s
pt_br: Não é possível alterar %(option_name)s %(attr)s

source: Cannot change Domain ID
es: No se puede cambiar el ID del Dominio
fr: Impossible de modifier l'ID du domaine
pt_br: Não é possível alterar o ID do Domínio

source: Cannot change user ID
es: No se puede cambiar el ID de usuario
fr: Impossible de modifier l'ID utilisateur
pt_br: Não é possível alterar o ID do usuário

source: Cannot change user name
es: No se puede cambiar el nombre de usuario
fr: Impossible de modifier le nom d'utilisateur
pt_br: Não é possível alterar o nome de usuário

source: Cannot create an endpoint with an invalid URL: %(url)s
es: No se puede crear un punto final con un URL no válido: %(url)s
fr: Impossible de créer un nœud final avec une URL non valide : %(url)s
pt_br: Não é possível criar um terminal com uma URL inválida: %(url)s

source: Cannot create project with parent: %(project_id)s
es: No se puede crear un proyecto con el padre: %(project_id)s
fr: Impossible de créer le projet %(project_id)s avec le parent
pt_br: Não é possível criar o projeto com o pai: %(project_id)s

source: Cannot create project, since it specifies its owner as domain %(domain_id)s, but specifies a parent in a different domain (%(parent_domain_id)s).
es: No se puede crear el proyecto porque especifica que su propietario es el dominio %(domain_id)s, pero especifica un padre en otro dominio distinto (%(parent_domain_id)s).
fr: Impossible de créer le projet, car il indique son propriétaire comme domaine %(domain_id)s, mais spécifie un parent figurant dans un autre domaine (%(parent_domain_id)s).
pt_br: Não é possível criar o projeto porque ele especifica seu proprietário como domínio %(domain_id)s, mas especifica um pai em um domínio diferente (%(parent_domain_id)s).

source: Cannot create project, since its parent (%(domain_id)s) is acting as a domain, but project's specified parent_id (%(parent_id)s) does not match this domain_id.
es: No se puede crear el proyecto porque su padre (%(domain_id)s) actúa como dominio, pero el parent_id especificado en el proyecto, (%(parent_id)s), no coincide con este domain_id.
fr: Impossible de créer le projet, car son parent (%(domain_id)s) fait office de domaine, mais l'ID parent (%(parent_id)s) spécifié pour le projet ne correspond pas à cet ID de domaine (domain_id).
pt_br: Não é possível criar um projeto porque seu pai (%(domain_id)s) está agindo como um domínio, mas o parent_id (%(parent_id)s) especificado do projeto não corresponde com esse domain_id.

source: Cannot delete a domain that is enabled, please disable it first.
es: No se puede suprimir un dominio que está habilitado, antes debe inhabilitarlo.
fr: Impossible de supprimer un domaine activé, veuillez d'abord le désactiver.
pt_br: Não é possível excluir um domínio que esteja ativado, desative-o primeiro.

source: Cannot delete project %(project_id)s since its subtree contains enabled projects.
es: No se puede suprimir el proyecto %(project_id)s porque su subárbol contiene proyectos habilitados.
fr: Impossible de supprimer le projet %(project_id)s car son sous-arbre contient des projets activés.
pt_br: Não é possível excluir o projeto%(project_id)s porque sua subárvore contém projetos ativados.

source: Cannot delete the project %s since it is not a leaf in the hierarchy. Use the cascade option if you want to delete a whole subtree.
es: No se puede suprimir el proyecto %s porque no es una hoja en la jerarquía. Utilice la opción de cascada si desea suprimir un subárbol entero.
fr: Impossible de supprimer le projet %s car il ne s'agit pas d'une feuille dans la hiérarchie. Utilisez l'option cascade si vous voulez supprimer un sous-arbre complet.
pt_br: Não é possível excluir o projeto %s porque ele não é uma folha na hierarquia. Use a opção em cascata se desejar excluir uma subárvore inteira.

source: Cannot disable project %(project_id)s since its subtree contains enabled projects.
es: No se puede inhabilitar el proyecto %(project_id)s porque su subárbol contiene proyectos habilitados.
fr: Impossible de désactiver le projet %(project_id)s car son sous-arbre contient des projets activés.
pt_br: Não é possível desativar o projeto%(project_id)s porque sua subárvore contém projetos ativados.

source: Cannot enable project %s since it has disabled parents
es: No se puede habilitar el proyecto %s, ya que tiene padres inhabilitados
fr: Impossible d'activer le projet %s car ses parents sont désactivés
pt_br: Não é possível ativar o projeto %s porque ele possui pais desativados

source: Cannot list assignments sourced from groups and filtered by user ID.
es: No se pueden enumerar las asignaciones obtenidas de grupos y filtradas por ID de usuario.
fr: Impossible de répertorier les affectations en provenance de groupes et filtrées par ID utilisateur.
pt_br: Não é possível listar designações originadas a partir de grupos e filtradas pelo ID do usuário.

source: Cannot list request tokens with a token issued via delegation.
es: No se pueden listar los tokens de solicitud con un token emitido por delegación.
fr: Impossible de répertorier des jetons de demande avec un jeton émis via une délégation.
pt_br: Não é possível listar os tokens de solicitação com um token emitido por meio de delegação.

source: Cannot open certificate %(cert_file)s. Reason: %(reason)s
es: No se puede abrir el certificado %(cert_file)s. Motivo: %(reason)s
fr: Impossible d'ouvrir le certificat %(cert_file)s. Raison : %(reason)s
pt_br: Não é possível abrir o certificado %(cert_file)s. Motivo: %(reason)s

source: Cannot remove role that has not been granted, %s
es: No se puede eliminar un rol que no se ha otorgado, %s
fr: Impossible de retirer le rôle qui n'est pas accordé, %s
pt_br: Não é possível remover a função que não foi concedida, %s

source: Cannot truncate a driver call without hints list as first parameter after self
es: No se puede truncar una llamada de controlador sin la lista de sugerencias como primer parámetro después de self
fr: Impossible de tronquer un appel de pilote sans hints list comme premier paramètre après self
pt_br: Não é possível truncar uma chamada de driver sem uma lista de sugestões como primeiro parâmetro após self

source: Cannot update domain_id of a project that has children.
es: No se puede actualizar el domain_id de un proyecto que tenga hijos.
fr: Impossible de mettre à jour l'ID de domaine (domain_id) d'un projet comportant des enfants.
pt_br: Não é possível atualizar domain_id de um projeto que possua filhos.

source: Cannot use parents_as_list and parents_as_ids query params at the same time.
es: No se pueden utilizar los parámetros de consulta parents_as_list y parents_as_ids al mismo tiempo.
fr: Impossible d'utiliser les paramètres d'interrogation parents_as_list et parents_as_ids en même temps.
pt_br: Não é possível usar parâmetros de consulta parents_as_list e parents_as_ids ao mesmo tempo.

source: Cannot use subtree_as_list and subtree_as_ids query params at the same time.
es: No se pueden utilizar los parámetros de consulta subtree_as_list y subtree_as_ids al mismo tiempo.
fr: Impossible d'utiliser les paramètres d'interrogation subtree_as_list et subtree_as_ids en même temps.
pt_br: Não é possível usar parâmetros de consulta subtree_as_list e subtree_as_ids ao mesmo tempo.

source: Cascade update is only allowed for enabled attribute.
es: Solo se permite la actualización en cascada de los atributos habilitados.
fr: La mise à jour en cascade n'est autorisée que pour l'attribut activé.
pt_br: A atualização em cascata é permitida somente para atributo ativado.

source: Combining effective and group filter will always result in an empty list.
es: La combinación de filtro de grupo y filtro efectivo dará siempre como resultado una lista vacía.
fr: Le fait de combiner un filtre effectif et un filtre de groupes produira toujours une liste vide.
pt_br: Combinar filtros efetivos e de grupo sempre resultará em uma lista vazia.

source: Combining effective, domain and inherited filters will always result in an empty list.
es: La combinación de un filtro heredado, un filtro de dominio y un filtro efectivo dará siempre como resultado una lista vacía.
fr: Le fait de combiner des filtres effectifs, de domaine et hérités produira toujours une liste vide.
pt_br: Combinar filtros efetivos, de domínio e herdados sempre resultará em uma lista vazia.

source: Config API entity at /domains/%s/config
es: Entidad de API de config en /domains/%s/config
fr: Entité Config API à /domains/%s/config
pt_br: Entidade de API de configuração em /domains/%s/config

source: Conflict occurred attempting to store %(type)s - %(details)s
es: Se ha producido un conflicto al intentar almacenar %(type)s - %(details)s
fr: Un conflit s'est produit lors de la tentative de stockage de %(type)s - %(details)s
pt_br: Ocorreu um conflito ao tentar armazenar %(type)s -%(details)s

source: Conflicting region IDs specified: "%(url_id)s" != "%(ref_id)s"
es: Se han especificado ID de región conflictivos: "%(url_id)s" != "%(ref_id)s"
fr: ID de région indiqués en conflit : "%(url_id)s" != "%(ref_id)s"
pt_br: IDs de região conflitantes especificados: "%(url_id)s" != "%(ref_id)s"

source: Consumer not found
es: No se ha encontrado el consumidor
fr: Consommateur non trouvé
pt_br: Consumidor não encontrado

source: Could not change immutable attribute(s) '%(attributes)s' in target %(target)s
es: No se pueden cambiar atributos inalterables '%(attributes)s' en el destino %(target)s
fr: Impossible de modifier le(s) attribut(s) non modifiable(s) '%(attributes)s' dans la cible %(target)s
pt_br: Não foi possível alterar os atributos imutáveis '%(attributes)s' no destino %(target)s

source: Could not determine Identity Provider ID. The configuration option %(issuer_attribute)s was not found in the request environment.
es: No se ha podido determinar el ID del proveedor de identidades. No se ha encontrado la opción de configuración %(issuer_attribute)s en el entorno de la solicitud.
fr: Impossible de déterminer l'ID du fournisseur d'identité. L'option de configuration %(issuer_attribute)s est introuvable dans l'environnement de demande.
pt_br: Não foi possível determinar o ID do Provedor de Identidade. A opção de configuração %(issuer_attribute)s não foi encontrada no ambiente da solicitação.

source: Could not find %(group_or_option)s in domain configuration for domain %(domain_id)s
es: No se ha podido encontrar %(group_or_option)s en la configuración de dominio para el dominio %(domain_id)s
fr: Impossible de trouver %(group_or_option)s dans la configuration de domaine pour le domaine %(domain_id)s
pt_br: Não foi possível localizar %(group_or_option)s na configuração de domínio para o domínio %(domain_id)s

source: Could not find Endpoint Group: %(endpoint_group_id)s
es: No se ha encontrado el grupo de puntos finales: %(endpoint_group_id)s
fr: Impossible de trouver le groupe de nœuds finaux : %(endpoint_group_id)s
pt_br: Não foi possível localizar o Grupo do Terminal: %(endpoint_group_id)s

source: Could not find Identity Provider identifier in environment
es: No se ha podido encontrar el identificador del proveedor de identidad en el entorno
fr: Identificateur de fournisseur d'identité introuvable dans l'environnement
pt_br: Não foi possível localizar o identificador do Provedor de Identidade no ambiente

source: Could not find Identity Provider: %(idp_id)s
es: No se ha podido encontrar el proveedor de identidad: %(idp_id)s
fr: Impossible de trouver le fournisseur d'identité : %(idp_id)s
pt_br: Não foi possível localizar o Provedor de Identidade: %(idp_id)s

source: Could not find Service Provider: %(sp_id)s
es: No se ha podido encontrar el proveedor de servicios: %(sp_id)s
fr: Impossible de trouver le fournisseur de services : %(sp_id)s
pt_br: Não foi possível localizar o Provedor de Serviços: %(sp_id)s

source: Could not find credential: %(credential_id)s
es: No se ha podido encontrar la credencial: %(credential_id)s
fr: Impossible de trouver les données d'identification : %(credential_id)s
pt_br: Não foi possível localizar a credencial: %(credential_id)s

source: Could not find domain: %(domain_id)s
es: No se ha podido encontrar el dominio: %(domain_id)s
fr: Impossible de trouver le domaine : %(domain_id)s
pt_br: Não foi possível localizar o domínio: %(domain_id)s

source: Could not find endpoint: %(endpoint_id)s
es: No se ha podido encontrar : %(endpoint_id)s
fr: Impossible de trouver le nœud final : %(endpoint_id)s
pt_br: Não foi possível localizar terminal: %(endpoint_id)s

source: Could not find federated protocol %(protocol_id)s for Identity Provider: %(idp_id)s
es: No se ha podido encontrar el protocolo federado %(protocol_id)s para el proveedor de identidad: %(idp_id)s
fr: Impossible de trouver le protocole fédéré %(protocol_id)s pour le fournisseur d'identité : %(idp_id)s
pt_br: Não foi possível localizar o protocolo federado %(protocol_id)s para o Provedor de Identidade: %(idp_id)s

source: Could not find group: %(group_id)s
es: No se ha podido encontrar el grupo: %(group_id)s
fr: Impossible de trouver le groupe : %(group_id)s
pt_br: Não foi possível localizar o grupo: %(group_id)s
