Repository: jixianbo/openstack-mitaka
Catalog: keystone/locale/*/LC_MESSAGES/keystone.po
Languages: es, fr, pt_br

source: The %s extension has been moved into keystone core and as such its migrations are maintained by the main keystone database control. Use the command: keystone-manage db_sync
es: La extensión %s se ha trasladado al núcleo de keystone y, como tal, el mantenimiento de sus migraciones se hace desde el control de bases de datos principal de keystone. Utilice el comando: keystone-manage db_sync
fr: L'extension %s a été déplacée vers le noyau Keystone et ses migrations sont donc gérées par le contrôle de la base de données Keystone principale. Utilisez la commande : keystone-manage db_sync
pt_br: A extensão %s foi movida para o núcleo do keystone e, com isso, suas migrações são mantidas pelo controle de banco de dados keystone principal. Use o comando: keystone-manage db_sync

source: The 'expires_at' must not be before now. The server could not comply with the request since it is either malformed or otherwise incorrect. The client is assumed to be in error.
es: El valor de 'expires_at' no debe ser antes que el momento actual. El servidor no ha podido satisfacer la solicitud porque está mal formada o es incorrecta por algún otro motivo. Se entiende que el cliente da error.
fr: La valeur de 'expires_at' ne doit pas être située dans le passé. Le serveur n'a pas pu se conformer à la demande car elle est incorrectement formée ou incorrecte. Le client est considéré comme étant à l'état d'erreur.
pt_br: O 'expires_at' não deve ser anterior a agora. O servidor não pôde atender à solicitação porque ela está malformada ou de outra maneira incorreta. Supõe-se que o cliente está em erro erro.

source: The --all option cannot be used with the --domain-name option
es: La opción --all no se puede utilizar con la opción --domain-name
fr: L'option --all ne peut pas être utilisée avec l'option --domain-name
pt_br: A opção --all não pode ser usada com a opção --domain-name

source: The Keystone configuration file %(config_file)s could not be found.
es: No se ha podido encontrar el archivo de configuración de Keystone %(config_file)s.
fr: Le fichier de configuration Keystone %(config_file)s est introuvable.
pt_br: O arquivo de configuração do Keystone %(config_file)s não pôde ser localizado.

source: The Keystone domain-specific configuration has specified more than one SQL driver (only one is permitted): %(source)s.
es: La configuración específica del dominio Keystone ha especificado más de un controlador SQL (sólo se permite uno): %(source)s.
fr: La configuration spécifique au domaine Keystone a spécifié plusieurs pilotes SQL (un seul est autorisé) : %(source)s.
pt_br: A configuração específica de domínio Keystone especificou mais de um driver SQL (somente um é permitido): %(source)s.

source: The action you have requested has not been implemented.
es: La acción que ha solicitado no está implementada
fr: L'action que vous avez demandée n'est pas implémentée.
pt_br: A ação que você solicitou não foi implementada.

source: The authenticated user should match the trustor.
es: El usuario autenticado debe coincidir con el fideicomitente.
fr: L'utilisateur authentifié doit correspondre au fiduciant.
pt_br: O usuário autenticado deve corresponder ao fideicomitente.

source: The certificates you requested are not available. It is likely that this server does not use PKI tokens otherwise this is the result of misconfiguration.
es: Los certificados que ha solicitado no están disponibles. Es probable que este servidor no utilice tokens PKI o que se haya hecho una configuración incorrecta.
fr: Les certificats que vous avez demandés ne sont pas disponibles. Il est probable que ce serveur n'utilise pas des jetons PKI ; sinon, ceci est le résultat d'un problème de configuration.
pt_br: Os certificados que você solicitou não estão disponíveis. É provável que esse servidor não utiliza tokens PKI, caso contrário, este é o resultado de configuração incorreta.

source: The configured token provider does not support bind authentication.
es: El proveedor de señales configurado no da soporte a la autenticación de enlaces.
fr: Le fournisseur de jeton configuré ne prend pas en charge l'authentification par liaison.
pt_br: O provedor de token configurado não suporta autenticação de ligação.

source: The creation of projects acting as domains is not allowed in v2.
es: En la v2, no se permite crear proyectos que actúen como dominios.
fr: La création de projets faisant office de domaines n'est pas autorisée en v2.
pt_br: A criação de projetos agindo como domínios não é permitida na v2.

source: The password length must be less than or equal to %(size)i. The server could not comply with the request because the password is invalid.
es: La longitud de la contraseña debe ser menor o igual que %(size)i. El servidor no ha podido satisfacer la solicitud porque la contraseña no es válida.
fr: La longueur du mot de passe doit être inférieure ou égale à %(size)i. Le serveur n'a pas pu se conformer à la demande car le mot de passe n'est pas valide.
pt_br: O comprimento da senha deve ser menor ou igual a %(size)i. O servidor não pôde atender à solicitação porque a senha é inválida.

source: The request you have made requires authentication.
es: La solicitud que ha hecho requiere autenticación.
fr: La demande que vous avez présentée requiert une authentification.
pt_br: A solicitação que você fez requer autenticação.

source: The resource could not be found.
es: No se ha podido encontrar el recurso.
fr: La ressource est introuvable.
pt_br: O recurso não pôde ser localizado.

source: The revoke call must not have both domain_id and project_id. This is a bug in the Keystone server. The current request is aborted.
es: La llamada de revocación debe tener un id_dominio y un id_proyecto. Esto es un error del servidor de Keystone. La solicitud actual ha terminado anormalmente.
fr: L'appel de révocation ne doit pas contenir à la fois domain_id et project_id. Il s'agit d'un bogue sur le serveur Keystone. La demande en cours est abandonnée.
pt_br: A chamada de revogação não deve ter domain_id e project_id. Esse é um erro no servidor do Keystone. A solicitação atual foi interrompida.

source: The service you have requested is no longer available on this server.
es: El servicio que ha solicitado ya no está disponible en este servidor.
fr: Le service que vous avez demandé n'est plus disponible sur ce serveur.
pt_br: O serviço que você solicitou não está mais disponível neste servidor.

source: The specified parent region %(parent_region_id)s would create a circular region hierarchy.
es: La región padre %(parent_region_id)s especificada crearía una jerarquía de regiones circular.
fr: La région parente spécifiée %(parent_region_id)s pourrait créer une hiérarchie de région circulaire.
pt_br: A região pai especificada %(parent_region_id)s criaria uma hierarquia de região circular.

source: The value of group %(group)s specified in the config should be a dictionary of options
es: El valor de grupo %(group)s especificado en la configuración debe ser un diccionario de opciones
fr: La valeur du groupe %(group)s spécifié dans la configuration doit être un dictionnaire d'options
pt_br: O valor do grupo %(group)s especificado na configuração deverá ser um dicionário de opções

source: There should not be any non-oauth parameters
es: Solo puede haber parámetros de oauth
fr: Il ne doit y avoir aucun paramètre non-oauth
pt_br: Não deve haver nenhum parâmetro não oauth

source: This is not a recognized Fernet payload version: %s
es: Esta no es una versión de carga útil Fernet reconocida: %s
fr: Il ne s'agit pas d'une version de contenu Fernet reconnue : %s
pt_br: Esta não é uma versão de carga útil do Fernet reconhecida: %s

source: This is not a recognized Fernet token %s
es: Este no es un token Fernet reconocido %s
fr: Il ne s'agit pas d'un jeton Fernet reconnu %s
pt_br: Este não é um token Fernet %s reconhecido

source: Timestamp not in expected format. The server could not comply with the request since it is either malformed or otherwise incorrect. The client is assumed to be in error.
es: La indicación de fecha y hora no está en el formato esperado. El servidor no ha podido satisfacer la solicitud porque está mal formada o es incorrecta por algún otro motivo. Se entiende que el cliente da error.
fr: L'horodatage n'est pas au format attendu. Le serveur n'a pas pu se conformer à la demande car elle est incorrectement formée ou incorrecte. Le client est considéré comme étant à l'état d'erreur.
pt_br: O registro de data e hora não está no formato especificado. O servidor não pôde atender à solicitação porque ela está mal formada ou de outra maneira incorreta. Supõe-se que o cliente está em erro.

source: To get a more detailed information on this error, re-run this command for the specific domain, i.e.: keystone-manage domain_config_upload --domain-name %s
es: Para obtener información más detallada sobre este error, vuelva a ejecutar este mandato para el dominio especificado, por ejemplo: keystone-manage domain_config_upload --domain-name %s
fr: Pour obtenir des informations plus détaillées sur cette erreur, réexécutez cette commande pour le domaine spécifique, par exemple : keystone-manage domain_config_upload --domain-name %s
pt_br: Para obter informações mais detalhadas sobre este erro, execute novamente este comando para o domínio específico, ou seja: keystone-manage domain_config_upload --domain-name %s

source: Token belongs to another user
es: El token pertenece a otro usuario
fr: Le jeton appartient à un autre utilisateur
pt_br: O token pertence a outro usuário

source: Token does not belong to specified tenant.
es: El token no pertenece al arrendatario especificado.
fr: Le jeton n'appartient pas au locataire spécifié.
pt_br: O token não pertence ao locatário especificado.

source: Token version is unrecognizable or unsupported.
es: Versión de token no reconocida o no soportada.
fr: Version de jeton non reconnue ou non prise en charge.
pt_br: A versão de Token é irreconhecida ou não suportada

source: Trustee has no delegated roles.
es: La entidad de confianza no tiene roles delegados.
fr: Le fiduciaire n'a aucun rôle délégué.
pt_br: O fiduciário não possui funções delegadas.

source: Trustor is disabled.
es: El fideicomitente está deshabilitado.
fr: Le fiduciant est désactivé.
pt_br: O fideicomitente está desativado.

source: Trying to update group %(group)s, so that, and only that, group must be specified in the config
es: Intentando actualizar el grupo %(group)s, de forma que se pueda especificar ese grupo, y solo ese, enla configuración
fr: Tentative de mise à jour du groupe %(group)s, de sorte que le groupe est spécifié dans la configuration uniquement
pt_br: Tentando atualizar o grupo %(group)s de modo que, e apenas que, o grupo deve ser especificado na configuração

source: Trying to update option %(option)s in group %(group)s, but config provided contains option %(option_other)s instead
es: Intentando actualizar la opción %(option)s en el grupo %(group)s, pero la configuración proporcionada contiene la opción %(option_other)s en su lugar
fr: Tentative de mise à jour de l'option %(option)s dans le groupe %(group)s, mais la configuration fournie contient l'option %(option_other)s à la place
pt_br: Tentando atualizar a opção %(option)s no grupo %(group)s, mas a configuração fornecida contém %(option_other)s

source: Trying to update option %(option)s in group %(group)s, so that, and only that, option must be specified in the config
es: Intentando actualizar la opción %(option)s en el grupo %(group)s, de forma que se pueda especificar esa opción, y solo esa, en la configuración
fr: Tentative de mise à jour de l'option %(option)s dans le groupe %(group)s, de sorte que l'option est spécifiée dans la configuration uniquement
pt_br: Tentando atualizar a opção %(option)s no grupo %(group)s, de modo que, e apenas que, a opção deve ser especificada na configuração

source: Unable to access the keystone database, please check it is configured correctly.
es: No se puede acceder a la base de datos de keystone, compruebe que está configurada correctamente.
fr: Impossible d'accéder à la base de données Keystone, vérifiez qu'elle est correctement configurée.
pt_br: Não é possível acessar o banco de dados keystone, verifique se ele está configurado corretamente.

source: Unable to consume trust %(trust_id)s, unable to acquire lock.
es: No se puede consumir la confianza %(trust_id)s, no se puede adquirir el bloqueo.
fr: Impossible de consommer la confiance %(trust_id)s et d'acquérir un verrou.
pt_br: Não é possível consumir a confiança %(trust_id)s, não é possível adquirir o bloqueio.

source: Unable to delete region %(region_id)s because it or its child regions have associated endpoints.
es: No se puede suprimir la región %(region_id)s porque sus regiones secundarias tienen puntos finales asociados.
fr: Impossible de supprimer la région %(region_id)s car la région ou ses régions enfants comportent des nœuds finaux associés.
pt_br: Não é possível excluir a região %(region_id)s porque uma ou mais de suas regiões filhas possuem terminais associados.

source: Unable to downgrade schema
es: No se ha podido degradar el esquema
fr: Impossible de rétrograder le schéma
pt_br: Não é possível fazer downgrade do esquema

source: Unable to find valid groups while using mapping %(mapping_id)s
es: No se han podido encontrar grupos válidos utilizando la correlación %(mapping_id)s
fr: Impossible de trouver des groupes valides en utilisant le mappage %(mapping_id)s
pt_br: Não é possível localizar os grupos válidos ao utilizar o mapeamento %(mapping_id)s

source: Unable to locate domain config directory: %s
es: No se ha podido localizar el directorio config de dominio: %s
fr: Impossible de localiser le répertoire de configuration de domaine : %s
pt_br: Não é possível localizar o diretório de configuração de domínio: %s

source: Unable to lookup user %s
es: No se ha podido buscar el usuario %s
fr: Impossible de rechercher l'utilisateur %s
pt_br: Não é possível consultar o usuário %s

source: Unable to reconcile identity attribute %(attribute)s as it has conflicting values %(new)s and %(old)s
es: No se puede reconciliar el atributo de identidad %(attribute)s porque tiene los siguientes valores en conflicto: %(new)s y %(old)s
fr: Impossible de rapprocher l'attribut d'identité %(attribute)s car il comporte des valeurs en conflit : %(new)s et %(old)s
pt_br: Não é possível reconciliar o atributo de identidade %(attribute)s, pois ele possui valores conflitantes %(new)s e %(old)s

source: Unable to sign SAML assertion. It is likely that this server does not have xmlsec1 installed, or this is the result of misconfiguration. Reason %(reason)s
es: No se puede firmar la aserción SAML. Es probable que este servidor no tenga xmlsec1 instalado o que se haya hecho una configuración incorrecta. Motivo: %(reason)s
fr: Impossible de signer l'assertion SAML. Il est probable que xmlsec1 ne soit pas installé sur ce serveur ; sinon, cela est dû à un problème de configuration. Raison : %(reason)s
pt_br: Não é possível assinar asserção SAML. Provavelmente esse servidor não possui o xmlsec1 instalado, ou isso é o resultado de uma configuração incorreta. Motivo %(reason)s

source: Unable to sign token.
es: No se ha podido firmar el token.
fr: Impossible de signer le jeton.
pt_br: Não é possível assinar o token.

source: Unexpected assignment type encountered, %s
es: Se ha encontrado un tipo de asignación inesperado, %s
fr: Type d'affectation inattendu, %s
pt_br: Tipo de designação inesperado encontrado, %s

source: Unexpected combination of grant attributes - User: %(user_id)s, Group: %(group_id)s, Project: %(project_id)s, Domain: %(domain_id)s
es: Combinación no esperada de atributos de otorgamiento - Usuario: %(user_id)s, Grupo: %(group_id)s, Proyecto: %(project_id)s, Dominio: %(domain_id)s
fr: Combinaison inattendue d'attributs d'octroi - Utilisateur : %(user_id)s. Groupe : %(group_id)s. Projet : %(project_id)s. Domaine : %(domain_id)s
pt_br: Combinação inesperada de atributos de concessão – Usuário: %(user_id)s, Grupo: %(group_id)s, Projeto: %(project_id)s, Domínio: %(domain_id)s

source: Unexpected status requested for JSON Home response, %s
es: Estado inesperado solicitado para la respuesta de JSON Home, %s
fr: Statut inattendu demandé pour la réponse JSON Home, %s
pt_br: Status inesperado solicitado para resposta JSON Home, %s

source: Unknown Target
es: Destino desconocido
fr: Cible inconnue
pt_br: Alvo Desconhecido

source: Unknown domain '%(name)s' specified by --domain-name
es: Dominio desconocido '%(name)s' especificado por --domain-name
fr: Domaine inconnu '%(name)s' spécifié par --domain-name
pt_br: Domínio desconhecido '%(name)s' especificado pelo --domain-name

source: Unknown token version %s
es: Versión de token desconocida %s
fr: Version de jeton inconnue %s
pt_br: Versão de token desconhecida %s

source: Unregistered dependency: %(name)s for %(targets)s
es: Dependencia no registrada: %(name)s para %(targets)s
fr: Dépendance désenregistrée : %(name)s pour %(targets)s
pt_br: Dependência não registrada: %(name)s para %(targets)s

source: Update of `domain_id` is not allowed.
es: No se permite la actualización de `domain_id`.
fr: La mise à jour de `domain_id` n'est pas autorisée.
pt_br: Atualização de `domain_id` não é permitida.

source: Update of `is_domain` is not allowed.
es: No se permite la actualización de `is_domain`.
fr: La mise à jour de `is_domain` n'est pas autorisée.
pt_br: Atualização de `is_domain` não é permitida.

source: Update of `parent_id` is not allowed.
es: No se permite la actualización de `parent_id`.
fr: La mise à jour de `parent_id` n'est pas autorisée.
pt_br: Atualização de ‘parent_id’ não é permitida.

source: Update of domain_id is only allowed for root projects.
es: Solo se permite actualizar el domain_id de los proyectos raíz.
fr: La mise à jour de l'ID de domaine (domain_id) est autorisée uniquement pour les projets racine.
pt_br: A atualização de domain_id é permitida somente para projetos raízes.

source: Update of domain_id of projects acting as domains is not allowed.
es: No se permite actualizar el domain_id de los proyectos que actúen como dominios.
fr: La mise à jour de l'ID de domaine (domain_id) des projets faisant office de domaines n'est pas autorisée.
pt_br: Não é permitido atualizar domain_id de projetos que agem como domínios.

source: Use a project scoped token when attempting to create a SAML assertion
es: Utilice un token de ámbito de proyecto cuando intente crear una aserción SAML
fr: Utilisez un jeton configuré du projet lorsque vous essayez de créer une assertion SAML
pt_br: Use um token com escopo definido do projeto ao tentar criar uma asserção SAML

source: Use of the identity driver config to automatically configure the same assignment driver has been deprecated, in the "O" release, the assignment driver will need to be expicitly configured if different than the default (SQL).
es: El uso de la configuración del controlador de identidad para configurar automáticamente el mismo controlador de asignación está en desuso. En el release "O", el controlador de asignación se deberá configurar explícitamente si es distinto que el valor predeterminado (SQL).
fr: L'utilisation de la configuration du pilote d'identité pour configurer automatiquement le même pilote d'affectation est désormais obsolète. Dans l'édition "O", le pilote d'affectation doit être configuré de manière explicite s'il est différent de la valeur par défaut (SQL).
pt_br: O uso da configuração do driver de identidade para configurar automaticamente o mesmo driver de designação foi descontinuado. Na liberação "O", o driver de designação precisará ser configurado explicitamente caso seja diferente do padrão (SQL).

source: User %(u_id)s is unauthorized for tenant %(t_id)s
es: El usuario %(u_id)s no está autorizado en el proyecto %(t_id)s
fr: L'utilisateur %(u_id)s n'est pas autorisé pour le locataire %(t_id)s
pt_br: O usuário %(u_id)s não está autorizado para o locatário %(t_id)s

source: User %(user_id)s has no access to domain %(domain_id)s
es: El usuario %(user_id)s no tiene acceso al dominio %(domain_id)s
fr: L'utilisateur %(user_id)s n'a pas accès au domaine %(domain_id)s
pt_br: O usuário %(user_id)s não tem acesso ao domínio %(domain_id)s

source: User %(user_id)s has no access to project %(project_id)s
es: El usuario %(user_id)s no tiene acceso al proyecto %(project_id)s
fr: L'utilisateur %(user_id)s n'a pas accès au projet %(project_id)s
pt_br: O usuário %(user_id)s não tem acesso ao projeto %(project_id)s

source: User %(user_id)s is already a member of group %(group_id)s
es: El usuario %(user_id)s ya es miembro del grupo %(group_id)s
fr: L'utilisateur %(user_id)s est déjà membre du groupe %(group_id)s
pt_br: O usuário %(user_id)s já é membro do grupo %(group_id)s

source: User '%(user_id)s' not found in group '%(group_id)s'
es: No se ha encontrado el usuario '%(user_id)s' en el grupo '%(group_id)s'
fr: Utilisateur '%(user_id)s' non trouvé dans le groupe '%(group_id)s'
pt_br: Usuário '%(user_id)s' não localizado no grupo '%(group_id)s'

source: User IDs do not match
es: Los ID de usuario no coinciden
fr: Les ID utilisateur ne correspondent pas.
pt_br: O ID de usuário não corresponde

source: User auth cannot be built due to missing either user id, or user name with domain id, or user name with domain name.
es: No se puede crear la autorización de usuario porque falta el ID de usuario o el nombre de usuario con el ID de dominio, o el nombre de usuario con el nombre de dominio.
fr: L'authentification utilisateur ne peut pas être créée en raison de l'absence d'un ID, utilisateur, nom d'utilisateur avec ID de domaine ou nom d'utilisateur avec nom de domaine.
pt_br: A autenticação do usuário não pode ser construída porque está faltando o ID ou o nome do usuário com o ID do domínio ou o nome do usuário com o nome do domínio.

source: User is disabled: %s
es: El usuario está inhabilitado: %s
fr: Utilisateur désactivé : %s
pt_br: O usuário está desativado: %s

source: User is not a member of the requested project
es: El usuario no es miembro del proyecto solicitado
fr: L'utilisateur n'est pas membre du projet demandé
pt_br: O usuário não é membro do projeto solicitado

source: User is not a trustee.
es: El usuario no es de confianza.
fr: L'utilisateur n'est pas un fiduciaire.
pt_br: Usuário não é um fiduciário.

source: User not found
es: Usuario no encontrado
fr: Utilisateur introuvable
pt_br: Usuário não localizado

source: User not valid for tenant.
es: Usuario no válido para este arrendatario.
fr: Utilisateur non valide pour le locataire.
pt_br: O usuário não é válido para o locatário.

source: User roles not supported: tenant_id required
es: Roles de usuario no admitidos: tenant_id obligatorio
fr: Rôles utilisateur non pris en charge : tenant_id est obligatoire
pt_br: Papéis de usuários não suportados: necessário tenant_id

source: User type %s not supported
es: El tipo de usuario %s no está soportado
fr: Type d'utilisateur %s non pris en charge
pt_br: Tipo de usuário %s não suportado

source: You are not authorized to perform the requested action.
es: No está autorizado para realizar la acción solicitada.
fr: Vous n'êtes pas autorisé à effectuer l'action demandée.
pt_br: Você não está autorizado à realizar a ação solicitada.

source: You are not authorized to perform the requested action: %(action)s
es: No está autorizado para realizar la acción solicitada: %(action)s
fr: Vous n'êtes pas autorisé à effectuer l'action demandée : %(action)s
pt_br: Você não está autorizado a executar a ação solicitada: %(action)s
