Repository: jixianbo/openstack-mitaka
Catalog: keystone/locale/*/LC_MESSAGES/keystone.po
Languages: es, fr, pt_br

source: You have tried to create a resource using the admin token. As this token is not within a domain you must explicitly include a domain for this resource to belong to.
es: Ha intentado crear un recurso utilizando el token de administración. Dado que este token no se encuentra dentro de un dominio, debe incluir explícitamente un dominio al que pertenecerá este recurso.
fr: Vous avez essayé de créer une ressource à l'aide du jeton admin. Comme ce jeton ne figure pas dans un domaine, vous devez inclure explicitement un domaine auquel cette ressource doit appartenir.
pt_br: Você tentou criar um recurso usando o token de administração. Como esse token não está dentro de um domínio, deve-se incluir explicitamente um domínio ao qual esse recurso possa pertencer.

source: `key_mangler` functions must be callable.
es: Las funciones `key_mangler` deben ser invocables.
fr: Les fonctions `key_mangler` doivent pouvoir être appelées.
pt_br: Funções `key_mangler` devem ser chamáveis.

source: `key_mangler` option must be a function reference
es: La opción `key_mangler` debe ser una referencia de función
fr: L'option `key_mangler` doit être une référence de fonction
pt_br: A opção `key_mangler` deve ser uma referência de função

source: any options
es: cualesquiera opciones
fr: toutes les options
pt_br: quaisquer opções

source: auth_type is not Negotiate
es: auth_type no es Negotiate
fr: auth_type n'est pas négocié
pt_br: auth_type não é Negotiate

source: authorizing user does not have role required
es: el usuario de autorización no tiene el rol necesario
fr: l'utilisateur qui autorise n'a pas de rôle obligatoire
pt_br: O usuário autorizado não possui a função necessária

source: cannot create a project in a branch containing a disabled project: %s
es: No se puede crear un proyecto en una rama que contiene un proyecto inhabilitado: %s
fr: Impossible de créer un projet dans une branche contenant un projet désactivé : %s
pt_br: Não é possível criar um projeto em uma ramificação que contém um projeto desativado: %s

source: cannot delete an enabled project acting as a domain. Please disable the project %s first.
es: no se puede suprimir un proyecto habilitado que actúe como dominio. Inhabilite el proyecto %s.
fr: impossible de supprimer un projet activé faisant office de domaine. Veuillez d'abord désactiver le projet %s.
pt_br: Não é possível excluir um projeto ativado que age como um domínio. Desative o projeto %s primeiro.

source: group %(group)s
es: grupo %(group)s
fr: groupe %(group)s
pt_br: grupo %(group)s

source: idp_contact_type must be one of: [technical, other, support, administrative or billing.
es: idp_contact_type debe ser una de estas opciones: [técnico, otros, soporte, administrativo o facturación.
fr: idp_contact_type doit avoir l'une des valeurs suivantes : [technical, other, support, administrative ou billing.
pt_br: idp_contact_type deve ser uma dessas opções: [técnico, outro, suporte, administrativo ou faturamento.

source: invalid date format %s
es: formato de fecha no válido %s
fr: Format de date non valide %s
pt_br: formato de data inválido %s

source: it is not permitted to have two projects acting as domains with the same name: %s
es: no se permite tener dos proyectos actuando como dominios con el mismo nombre: %s
fr: il est interdit d'avoir deux projets faisant office de domaines avec le même nom : %s
pt_br: Não é permitido ter dois projetos agindo como domínios com o mesmo nome: %s

source: it is not permitted to have two projects within a domain with the same name : %s
es: no se permite tener dos proyectos dentro de un mismo dominio con el mismo nombre: %s
fr: il est interdit d'avoir deux projets au sein d'un domaine avec le même nom : %s
pt_br: Não é permitido ter dois projetos dentro de um domínio com o mesmo nome: %s

source: only root projects are allowed to act as domains.
es: Sólo los proyectos raíz pueden actuar como dominios.
fr: seuls les projets racine sont autorisés à faire office de domaines.
pt_br: Somente projetos raízes são permitidos para agirem como domínios.

source: option %(option)s in group %(group)s
es: opción %(option)s en el grupo %(group)s
fr: option %(option)s dans le groupe %(group)s
pt_br: opção %(option)s no grupo %(group)s

source: provided consumer key does not match stored consumer key
es: la clave de consumidor proporcionada no coincide con la clave de consumidor almacenada
fr: la clé de consommateur fournie ne correspond pas à la clé de consommateur stockée
pt_br: A chave de consumidor fornecida não confere com a chave de consumidor armazenada

source: provided request key does not match stored request key
es: la clave de solicitud proporcionada no coincide con la clave de solicitud almacenada
fr: la clé de demande fournie ne correspond pas à la clé de demande stockée
pt_br: A chave de solicitação fornecida não confere com a chave de solicitação armazenada

source: provided verifier does not match stored verifier
es: el verificador proporcionado no coincide con el verificador almacenado
fr: le vérificateur fourni ne correspond pas au vérificateur stocké
pt_br: O verificador fornecido não confere com o verificador armazenado

source: remaining_uses must be a positive integer or null.
es: remaining_uses debe ser un entero positivo o nulo.
fr: remaining_uses doit être un entier positif ou nul.
pt_br: remaining_uses deve ser um número inteiro positivo ou nulo.

source: remaining_uses must not be set if redelegation is allowed
es: remaining_uses no se debe establecer si se permite la redelegación
fr: remaining_uses ne doit pas être défini si la redélégation est autorisée
pt_br: remaining_uses não deverá ser definido se a nova delegação for permitida

source: request to update group %(group)s, but config provided contains group %(group_other)s instead
es: solicitud para actualizar el grupo %(group)s, pero la configuración proporcionada contiene el grupo %(group_other)s en su lugar
fr: demande de mise à jour du groupe %(group)s, mais la configuration fournie contient le groupe %(group_other)s à la place
pt_br: solicitação para atualizar o grupo %(group)s, mas a configuração fornecida contém o grupo %(group_other)s

source: rescope a scoped token
es: Volver a establecer el ámbito de un token con ámbito
fr: Reconfigurer un jeton configuré
pt_br: Defina novamente um escopo de um token com escopo

source: role %s is not defined
es: el rol %s no está definido
fr: Le rôle %s n'est pas défini
pt_br: O papel %s não foi definido

source: scope.project.id must be specified if include_subtree is also specified
es: Se debe especificar scope.project.id si se especifica también include_subtree
fr: scope.project.id doit être spécifié si include_subtree est également spécifié
pt_br: scope.project.id deverá ser especificado se include_subtree também for especificado

source: tls_cacertdir %s not found or is not a directory
es: No se ha encontrado tls_cacertdir %s o no es un directorio
fr: tls_cacertdir %s non trouvé ou il ne s'agit pas d'un répertoire
pt_br: tls_cacertdir %s não encontrado ou não é um diretório

source: tls_cacertfile %s not found or is not a file
es: No se ha encontrado tls_cacertfile %s o no es un archivo
fr: tls_cacertfile %s non trouvé ou il ne s'agit pas d'un fichier
pt_br: tls_cacertfile %s não encontrado ou não é um arquivo

source: token reference must be a KeystoneToken type, got: %s
es: la referencia de señal debe ser un tipo KeystoneToken, se ha obtenido: %s
fr: La référence de jeton doit être un type KeystoneToken, obtenu : %s
pt_br: A referência de token deve ser um tipo KeystoneToken, obteve: %s

source: update of domain_id is deprecated as of Mitaka and will be removed in O.
es: La actualización de domain_id está en desuso en Mitaka y se eliminará en O.
fr: la mise à jour de domain_id est obsolète depuis Mitaka et sera supprimée dans l'édition O.
pt_br: A atualização de domain_id foi descontinuada a partir do Mitaka e será removida na liberação O.

source: validated expected to find %(param_name)r in function signature for %(func_name)r.
es: En la validación se esperaba encontrar %(param_name)r en la firma de función para %(func_name)r.
fr: La validation s'attendait %(param_name)r dans la signature de fonction pour %(func_name)r.
pt_br: O validado esperava localizar %(param_name)r na assinatura da função para %(func_name)r.
